etc/OpenFOAM_Sample_Files/study_room/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.1 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.4;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		nut;
}

dimensions		[0 2 -1 0 0 0 0];

internalField		uniform 0;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    west_window
    {

        type		calculated;

    }

    room
    {

        type		nutkWallFunction;

        value		uniform 0.01;

        Cmu		0.09;

        kappa		0.41;

        E		9.8;

    }

    east_window
    {

        type		calculated;

    }

}